extends RefCounted

const КодыГенов = preload("res://геном/коды_генов.gd")


static func прочитать(части: PackedStringArray) -> Dictionary:
	if части.size() != 2:
		return {
			"ошибка": "Ген почкования должен иметь формат: 07,органика;"
		}

	var текст_органики: String = части[1].strip_edges()

	if not текст_органики.is_valid_float():
		return {
			"ошибка": "Органика модуля почкования должна быть числом."
		}

	var органика: float = текст_органики.to_float()

	if органика <= 0.0:
		return {
			"ошибка": "Органика модуля почкования должна быть больше нуля."
		}

	return {
		"тип": КодыГенов.ПОЧКОВАНИЕ,
		"органика": органика
	}
